## Plan for org_account/aft
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 36 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                                          NAME                                                                          |
|----------|--------------------------------------------------------------------------------------------------------------------------------------------------------|
| add      | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_query_definition.account_id_query`                      |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_query_definition.customization_request_query`           |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_cleanup_resources`                             |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role.aft_cleanup_resources`                                         |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_cleanup_resources`                                  |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy_attachment.aft_cleanup_resources[0]`                    |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy_attachment.aft_cleanup_resources[1]`                    |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources`                                  |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_s3_bucket_public_access_block.aft-codepipeline-customizations-block-public-access` |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_invoke_aft_cleanup_resources_lambda_function_name`               |
| update   | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_states`                                        |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm`                              |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role`                                       |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata`                                  |
|          | `module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account`                                       |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_rule.aft_control_tower_events`                         |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_account_request_action_trigger`                     |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger`                     |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger`                      |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor`                          |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger`                          |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework`          |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_default_sg`                                      |
|          | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_endpoint_sg`                                     |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.primary-backend-bucket`                                     |
|          | `module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_public_access_block.secondary-backend-bucket`                                   |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_get_pipeline_executions_lambda`                                |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_invoke_customizations_sfn`                                     |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline`                               |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_get_pipeline_executions`                        |
|          | `module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_identify_targets`                               |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_delete_default_vpc`                                           |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enable_cloudtrail`                                            |
|          | `module.account_factory_for_terraform.module.aft_feature_options.aws_lambda_function.aft_enroll_support`                                               |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.aft_exec_role.aws_iam_role.role`                                                     |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.aft_service_role.aws_iam_role.role`                                                  |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.audit_exec_role.aws_iam_role.role`                                                   |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.audit_service_role.aws_iam_role.role`                                                |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.ct_management_exec_role.aws_iam_role.role`                                           |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.ct_management_service_role.aws_iam_role.role`                                        |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.log_archive_exec_role.aws_iam_role.role`                                             |
|          | `module.account_factory_for_terraform.module.aft_iam_roles.module.log_archive_service_role.aws_iam_role.role`                                          |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_codebuild_project.codebuild`                                                         |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_framework_repo_git_ref`                                          |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.aft_version`                                                         |
|          | `module.account_factory_for_terraform.module.aft_ssm_parameters.aws_ssm_parameter.tf_version`                                                          |
| recreate | `module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework`          |
|          | `module.account_factory_for_terraform.module.aft_lambda_layer.aws_lambda_layer_version.layer_version`                                                  |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-aws-lz/actions/runs/4204749850).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_query_definition.account_id_query will be created
  + resource "aws_cloudwatch_query_definition" "account_id_query" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/aft-account-provisioning-framework-create-aft-execution-role",
          + "/aws/lambda/aft-account-provisioning-framework-persist-metadata",
          + "/aws/lambda/aft-account-provisioning-framework-tag-account",
          + "/aws/lambda/aft-account-provisioning-framework-account-metadata-ssm",
          + "/aws/lambda/aft-delete-default-vpc",
          + "/aws/lambda/aft-enroll-support",
          + "/aws/lambda/aft-enable-cloudtrail",
        ]
      + name                = "Account Factory for Terraform/Customization Logs by Account ID"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log_message.account_id as target_account_id, log_message.customization_request_id as customization_request_id, log_message.detail as detail, @logStream
            | sort @timestamp desc
            | filter log_message.account_id == "INSERT-ACCOUNT-ID-HERE" and @message like /customization_request_id/
        EOT
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_query_definition.customization_request_query will be created
  + resource "aws_cloudwatch_query_definition" "customization_request_query" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/aft-account-provisioning-framework-create-aft-execution-role",
          + "/aws/lambda/aft-account-provisioning-framework-persist-metadata",
          + "/aws/lambda/aft-account-provisioning-framework-tag-account",
          + "/aws/lambda/aft-account-provisioning-framework-account-metadata-ssm",
          + "/aws/lambda/aft-delete-default-vpc",
          + "/aws/lambda/aft-enroll-support",
          + "/aws/lambda/aft-enable-cloudtrail",
        ]
      + name                = "Account Factory for Terraform/Customization Logs by Customization Request ID"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log_message.account_id as target_account_id, log_message.customization_request_id as customization_request_id, log_message.detail as detail, @logStream
            | sort @timestamp desc
            | filter log_message.customization_request_id == "INSERT-CUSTOMIZATION-REQUEST-ID-HERE"
        EOT
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_states will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_states" {
        id     = "aft-states-execution-role:aft-account-provisioning-framework-states-policy"
        name   = "aft-account-provisioning-framework-states-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (5 unchanged elements hidden)
                    {
                        Action   = [
                            "events:PutTargets",
                            "events:PutRule",
                            "events:DescribeRule",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:events:ca-central-1:137554749751:rule/StepFunctionsGetEventForCodeBuildStartBuildRule",
                        ]
                    },
                  + {
                      + Action   = [
                          + "states:DescribeExecution",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:states:ca-central-1:137554749751:execution:aft-*",
                        ]
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ last_modified                  = "2022-12-19T16:18:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Jncx3tOwvcHdsnqLt7uWXO7MiNRlYBIqxR5NXyKQlv8=" -> "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ last_modified                  = "2022-12-19T16:17:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Jncx3tOwvcHdsnqLt7uWXO7MiNRlYBIqxR5NXyKQlv8=" -> "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ last_modified                  = "2022-12-19T16:17:53.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Jncx3tOwvcHdsnqLt7uWXO7MiNRlYBIqxR5NXyKQlv8=" -> "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ last_modified                  = "2022-12-19T16:17:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "Jncx3tOwvcHdsnqLt7uWXO7MiNRlYBIqxR5NXyKQlv8=" -> "g5PomOXYb2xNlyPMSUB0JwYzXjWkT58E+tGLiIyHQWk="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_rule.aft_control_tower_events will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "aft_control_tower_events" {
      ~ event_pattern  = jsonencode(
          ~ {
              ~ detail      = {
                  ~ eventName = [
                      - "SetupLandingZone",
                      - "UpdateLandingZone",
                      - "RegisterOrganizationalUnit",
                      - "DeregisterOrganizationalUnit",
                      - "EnableGuardrail",
                      - "DisableGuardrail",
                        "CreateManagedAccount",
                        # (1 unchanged element hidden)
                    ]
                }
                # (2 unchanged elements hidden)
            }
        )
        id             = "aft-capture-ct-events"
        name           = "aft-capture-ct-events"
        tags           = {}
        # (5 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_cleanup_resources will be created
  + resource "aws_cloudwatch_log_group" "aft_cleanup_resources" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-cleanup-resources"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role.aft_cleanup_resources will be created
  + resource "aws_iam_role" "aft_cleanup_resources" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-lambda-cleanup-resources"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_account_request_action_trigger" {
        id     = "aft-lambda-account-request-action-trigger:aft-account-request-action-trigger"
        name   = "aft-account-request-action-trigger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:Query",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:137554749751:table/aft-request-audit"
                    },
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                          - "dynamodb:GetShardIterator",
                          - "dynamodb:DescribeStream",
                          - "dynamodb:GetRecords",
                          - "dynamodb:ListShards",
                          - "dynamodb:ListStreams",
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:137554749751:table/aft-request/stream/*",
                          - "arn:aws:lambda:ca-central-1:137554749751:function:aft-invoke-aft-account-provisioning-framework",
                          - "arn:aws:sqs:ca-central-1:137554749751:aft-account-request.fifo",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:ListStreams"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ssm:GetParameter"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sns:Publish",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          - "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:ca-central-1:137554749751:key/ea20f7e6-a30d-4de6-90a8-bbcec36d0d00",
                          - "arn:aws:kms:ca-central-1:137554749751:alias/aws/sns",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sts:AssumeRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::137554749751:role/AWSAFTAdmin",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_cleanup_resources will be created
  + resource "aws_iam_role_policy" "aft_cleanup_resources" {
      + id     = (known after apply)
      + name   = "aft-cleanup-resources"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:137554749751:table/aft-request-metadata",
                        ]
                    },
                  + {
                      + Action   = [
                          + "codepipeline:ListPipelineExecutions",
                          + "codepipeline:ListPipelines",
                          + "codepipeline:ListTagsForResource",
                          + "codepipeline:DeletePipeline",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:codepipeline:ca-central-1:137554749751:*",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sts:AssumeRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::137554749751:role/AWSAFTAdmin",
                        ]
                    },
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:ca-central-1:137554749751:key/ea20f7e6-a30d-4de6-90a8-bbcec36d0d00",
                          + "arn:aws:kms:ca-central-1:137554749751:alias/aws/sns",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework must be replaced
-/+ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework" {
      ~ id     = "aft-lambda-invoke-aft-account-provisioning-framework:aft-account-request-action-trigger" -> (known after apply)
      ~ name   = "aft-account-request-action-trigger" -> "aft-invoke-account-provisioning-framework" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy_attachment.aft_cleanup_resources[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_cleanup_resources" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-lambda-cleanup-resources"
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_iam_role_policy_attachment.aft_cleanup_resources[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_cleanup_resources" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-lambda-cleanup-resources"
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ last_modified                  = "2022-12-19T16:17:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "/Ds+B4lnKlOKt7jlX2gqI0x1CrvkpCekjNOF0dMfAow=" -> "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ last_modified                  = "2022-12-19T16:16:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "/Ds+B4lnKlOKt7jlX2gqI0x1CrvkpCekjNOF0dMfAow=" -> "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ last_modified                  = "2022-12-19T16:17:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "/Ds+B4lnKlOKt7jlX2gqI0x1CrvkpCekjNOF0dMfAow=" -> "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
        tags                           = {}
        # (19 unchanged attributes hidden)

      + environment {
          + variables = {
              + "AFT_PROVISIONING_CONCURRENCY" = "5"
            }
        }



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_cleanup_resources will be created
  + resource "aws_lambda_function" "aft_cleanup_resources" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Removes AFT pipeline resources when an account record is removed from the AFT repo"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_request_framework.zip"
      + function_name                  = "aft-cleanup-resources"
      + handler                        = "aft_cleanup_resources.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0515a15a716538d46",
            ]
          + subnet_ids         = [
              + "subnet-0b05be0fc30c14b59",
              + "subnet-0c8091b136c716050",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ last_modified                  = "2022-12-19T16:17:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "/Ds+B4lnKlOKt7jlX2gqI0x1CrvkpCekjNOF0dMfAow=" -> "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ last_modified                  = "2022-12-19T16:16:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-7-0:1",
        ] -> (known after apply)
      ~ source_code_hash               = "/Ds+B4lnKlOKt7jlX2gqI0x1CrvkpCekjNOF0dMfAow=" -> "r4HHzcsqfQtoemFeajjzfwfyv2gmXOULES99nZkB4JM="
        tags                           = {}
        # (19 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_default_sg will be updated in-place
  ~ resource "aws_security_group" "aft_vpc_default_sg" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound traffic to internet"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0515a15a716538d46"
        name                   = "aft-default-sg"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_security_group.aft_vpc_endpoint_sg will be updated in-place
  ~ resource "aws_security_group" "aft_vpc_endpoint_sg" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound traffic to internet"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-09ad5043dda360531"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/22",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/22",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/22",
                ]
              + description      = "Allow inbound SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/22",
                ]
              + description      = "Allow inbound TLS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "aft-endpoint-sg"
        tags                   = {}
        #...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
